<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
  "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>MyServer Documentation - CGI - www.myserverproject.net</title>
<meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link rel="stylesheet" type="text/css" href="../style/myserver.css" />
</head>
<body>
<table class="center" width="95%">
<tr>
<td class="center">
<h1 class="title">CGI<br />
</h1>
CGI (Common Gateway Interface) &eacute; a forma padr&atilde;o com que um servidor 
      web passa os dados do usu&aacute;rio para uma aplica&ccedil;&atilde;o e 
      ent&atilde;o retorna informa&ccedil;&atilde;o ao usu&aacute;rio. CGI depende 
      de scipts freq&uuml;entemente escritos em linguagens com <a href="php.htm">PHP</a> 
      ou <a href="perl.htm">Perl</a> para realizar as a&ccedil;&otilde;es que 
      s&atilde;o requisitadas pelo usu&aacute;rio. Para acessar o script CGI, 
      o nome da aplica&ccedil;&atilde;o &eacute; indicado no c&oacute;digo HTML.<br />
      <br />
      Por exemplo, se voc&ecirc; estiver criando um formul&aacute;rio, a URL do 
      script &eacute; indicada nos tags FORMs: <br>
      <br />
<span class="code"> &lt;FORM METHOD=POST
ACTION=www.myfiles.com/cgi-bin/myprog.pl&gt;</span>
<br /><br />
Obs:&nbsp; Qualquer Linguagem de&nbsp; Script que
consegue fazer 'pipe' para sa&iacute;da pode ser usada - voc&ecirc;
pode ter scripts em Shell Script, Python, etc. Voc&ecirc; s&oacute;
precisa configurar corretamente os MIME-Types correspondentes, e sua
linguagem favorita de scripts funcionar&aacute; no MyServer.
<br /><br />
Caso queira manter os scripts em um lugar, voc&ecirc; pode criar um
diret&oacute;rio <span
 style="font-family: courier new,courier,monospace; color: rgb(0, 102, 0);">cgi-bin</span>
dentro do diret&oacute;rio <span
 style="font-family: courier new,courier,monospace; color: rgb(0, 102, 0);">web</span>
no MyServer, como visto abaixo:

<br /><br />
      <div style="text-align: center;"><img src="../images/myfiles.png" title=""
 alt="Web folder" width="468" height="260" />
</div>
<div style="text-align: center;">A pasta cgi-bin est&aacute;
diretamente abaixo da pasta web selecionada.
</div>

      <p><br />
        <br />
        Contudo, scripts CGI podem ser colocados em qualquer lugar, contanto que 
        sua localiza&ccedil;&atilde;o seja colocada no c&oacute;digo HTML, e que 
        elas sejam mapeadas para ser CGI pela sua exten&ccedil;&atilde;o de arquivo.<br>
        <br>
        Scripts CGI geram um novo processo para cada request. Isso pode causar 
        alguns problemas de performance, mas assegura alguma seguran&ccedil;a 
        de modo que se o novo processo travar, o processo principal do MyServer 
        n&atilde;o &eacute; afetado.</p>
      </td></tr></table>
</body>
</html>
