<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
  "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>MyServer Documentation - Viewing You Web Site - www.myserverproject.net</title>
<meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link rel="stylesheet" type="text/css" href="../style/myserver.css" />
</head>
<body>
<table class="center" width="95%">
<tr>
<td class="center">
<h1 class="title">VISUALIZANDO SEU WEB SITE</h1>
<br />
  Uma vez tendo suas p&aacute;ginas web gravadas na pasta correta, voc&ecirc; 
  vai querer v&ecirc;-las, tanto na m&aacute;quina em que elas est&atilde;o gravadas, 
  quanto na Internet.<br /><br />
Para ver seus arquivos em sua m&aacute;quina local, digite:<br />
  <br />
  <font class="code">http://localhost</font><br />
  <br />
  na barra de endere&ccedil;os de seu browser.<br />
  <br />
  Para ver seus arquivos na Internet, voc&ecirc; pode digitar o IP de seu computador 
  em qualquer browser. Por exemplo, se seu endere&ccedil;o IP for 36.65.34.32 
  seus arquivos podem ser encontrados em:<br />
  <br />
  <a href="http://36.65.34.32/"><font class="code">http://36.65.34.32</font></a><br />
<br /><br />
      <h2>Usando um nome DNS</h2>
 Se voc&ecirc; preferir <font class="code"> http://william.homeip.net</font> 
  ao inv&eacute;s de seu endere&ccedil;o IP, voc&ecirc; tem que conseguir um nome 
  de DNS.<br /><br />
<br />
  Um nome DNS &eacute; um mecanismo de rede que associa um endere&ccedil;o IP 
  com um nome mn&ecirc;monico, como <a href="http://www.google.com/"
 target="_blank">www.google.com</a>. Voc&ecirc; pode conseguir um nome DNS usando 
  um sistema gr&aacute;tis como o <a href="http://www.DynDNS.org" target="_blank">DynDNS.org</a>. 
  Esse servi&ccedil;o &eacute; para PCs com conex&otilde;es sempre online (ADSL, 
  cabo,...) que podem ser acessados por um bom peda&ccedil;o do dia.<br /><br />
Se voc&ecirc; n&atilde;o tem um endere&ccedil;o IP est&aacute;tico, seu endere&ccedil;o 
  muda a cada vez que voc&ecirc; se conecta na Internet. Mas, com um nome de DNS 
  da DynDNS.org, voc&ecirc; est&aacute; acess&iacute;vel tanto se seu IP for din&acirc;mico 
  quanto se for est&aacute;tico.<br /><br />
Para voc&ecirc; se certificar que seu nome de DNS se refere &agrave; sua m&aacute;quina 
  a cada vez que voc&ecirc; se conectar na Internet, voc&ecirc; deve tamb&eacute;m 
  instalar um cliente de DNS din&acirc;mico. Voc&ecirc; pode pegar um cliente 
  DNS gr&aacute;tis no endere&ccedil;o <a
 href="http://www.sitedevelopers.com/" target="_blank">http://www.sitedevelopers.com</a>.<br />
  <br />
  <br />
  Se voc&ecirc; n&atilde;o gostar no nome <a href="http://myname.homeip.net/"target="_blank">http://myName.homeip.net</a> 
  mas preferiria ter um nome como <a href="http://www.myname.net/"target="_blank">http://www.myName.net</a> 
  voc&ecirc; precisa registrar um nome de dom&iacute;nio em um sistema pago.<br /><br />
</td></tr></table>
</body>
</html>