<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
  "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>MyServer Documentation - Web Server - www.myserverproject.net</title>
<meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link rel="stylesheet" type="text/css" href="../style/myserver.css" />
</head>
<body>
<table class="center" width="95%">
<tr>
<td class="center">
<h1 class="title">WEB SERVER</h1>
<h2 class="title">O que &eacute; um web server?</h2>
Um web server &eacute; uma aplica&ccedil;&atilde;o que permite que usu&aacute;rios 
  compartilhem documentos na Internet ou em uma rede local.<br /><br />
Para conectar-se a um webserver voc&ecirc; s&oacute; precisa de um browser.<br /><br />
 <img src="../images/webserver.png" title="" alt="Many clients connecting to a Web Server" class="box" width="394" height="513" /><br />
  Muitos clientes conectados a um servidor. <br /><br />
Essa imagem mostra como v&aacute;rios clientes podem estar conectados com seu 
  servidor ao mesmo tempo. Atrav&eacute;s da rede, o pedido chega ao seu servidor. 
  O servidor prepara uma resposta e a envia ao cliente. Com a evolu&ccedil;&atilde;o 
  da Internet, o modelo cliente-servidor &eacute; o modo mais simples de compartilhar 
  informa&ccedil;&atilde;o facilmente, permitindo a cada usu&aacute;rio decidir 
  o que quer compartilhar com outros usu&aacute;rios.<br /><br />
<h2 class="title"> Como os arquivos s&atilde;o compartilhados?</h2>
      No n&iacute;vel b&aacute;sico, o servidor compartilha documentos HTML e imagens. 
        Estes documentos e imagens s&atilde;o muito simples e est&aacute;ticos 
        e s&atilde;o os arquivos b&aacute;sicos que se v&ecirc; quando voc&ecirc; 
        acessa um website. Esses arquivos s&atilde;o transferidos por um protocolo 
        chamado Protocolo de Transfer&ecirc;ncia de Hipertexto (HTTP).<br />
        <br />
        Se for necess&aacute;rio conte&uacute;do din&acirc;mico, por exemplo - 
        para rodar um site de e-commerce, h&aacute; protocolos diferentes necess&aacute;rios. 
        Alguns dos protocolos s&atilde;o o Common Gateway Interface (CGI), o ISAPI, 
        o FastCGI, o Protocolo de Transfer&ecirc;ncia de Hipertexto Seguro (HTTPS).<br />
        <br />
        HTTP n&atilde;o &eacute; um protocolo seguro, porque os dados transmitidos 
        n&atilde;o s&atilde;o encriptados, para se ter uma transmiss&atilde;o 
        segura, voc&ecirc; tem que usar o protocolo HTTPS. Veja o protocolo HTTPS 
        <a href="HTTPS.html">aqui</a>.<br />
        <br />
      <br /><br />
      <h2 class="title">Tradu&ccedil;&atilde;o de caminhos</h2>
      Os servidores web traduzem o componente de caminho de uma URI para um recurso 
      local do sistema de arquivos. O caminho URI especificado pelo cliente &eacute; 
      relativo ao diret&oacute;rio raiz do web server (<a href="virtualhosts.html">Virtual 
      Hosts</a>). Por exemplo, o cliente pode requisitar um arquivo <span class="code">/mydirectory/myfile</span> 
      fazendo um requeste como esse:<br />
      <br />
      <span class="code"> GET /mydirectory/myfile HTTP/1.1<br />
      Host: www.host.com </span> <br />
      <br />
      O servidor mapeia o nome do arquivo para o diret&oacute;rio raiz atual. 
      Se o diret&oacute;rio raiz atual for <span class="code">/var/www</span> 
      o recurso que ele vai retornar ser&aacute; <span class="code">/var/www/mydirectory/myfile</span> 
      de acordo com a especifica&ccedil;&atilde;o de seu MIME Type.<br />
      <br />
    </td>
  </tr></table>
</body>
</html>