
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>Documentaci&oacute;n de MyServer - Configuraci&oacute;n B&aacute;sica del Servidor - www.myserverproject.net</title>
<meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link rel="stylesheet" type="text/css" href="../style/myserver.css" />
</head>
<body>
<?xml version="1.0" encoding="UTF-8"?>  
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
  "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<table class="center" width="95%">
<tr>
<td class="center">
<h1 class="title">CONFIGURACI&Oacute;N B&Aacute;SICA DEL SERVIDOR</h1>  
En el archivo <span class="code">myserver.xml</span> puede establecer su p&aacute;gina por defecto de sus sitios Web hospedados en MyServer.<br /> <br /> Las l&iacute;neas de abajo ya existen en su archivo de configuraci&oacute;n:<br />  
<p class="code">
&lt;DEFAULT_FILENAME0&gt;default.html&lt;/DEFAULT_FILENAME0&gt;<br /> &nbsp;&nbsp;&nbsp; &lt;DEFAULT_FILENAME1&gt;default.php&lt;/DEFAULT_FILENAME1&gt;<br /> &nbsp;&nbsp;&nbsp; &lt;DEFAULT_FILENAME2&gt;default.php3&lt;/DEFAULT_FILENAME2&gt;<br /> &nbsp;&nbsp;&nbsp; &lt;DEFAULT_FILENAME3&gt;index.html&lt;/DEFAULT_FILENAME3&gt;<br /> &nbsp;&nbsp;&nbsp; &lt;DEFAULT_FILENAME4&gt;index.php&lt;/DEFAULT_FILENAME4&gt;<br /> &nbsp;&nbsp;&nbsp; &lt;DEFAULT_FILENAME5&gt;index.php3&lt;/DEFAULT_FILENAME5&gt;<br /> &nbsp;&nbsp;&nbsp; &lt;DEFAULT_FILENAME6&gt;default.htm&lt;/DEFAULT_FILENAME6&gt; <br />  
</p>
<br /> Entonces si tiene un <a class="code" href="virtualhosts.html">Host Virtual</a> http://mypc.net, la p&aacute;gina que aparecer&aacute; cuando tenga acceso a la direcci&oacute;n del explorador ser&aacute; la de uno de los archivos de arriba. Puede agregar m&aacute;s l&iacute;neas o cambiar cualquiera de ellas, si necesita un nombre de archivo diferente. El mismo mecanismo puede ser usado por cada directorio y no s&oacute;lo con el ra&iacute;z.<br />  

<br /> <br /><br /> En la secci&oacute;n <a class="code" href="errorfiles.html">Errores</a> puede aprender como crear y usar sus propias p&aacute;ginas de error. Pero tambi&eacute;n puede deshabilitar las p&aacute;ginas de errores personalizadas al cambiar la l&iacute;nea de abajo.<br /> <span class="code">&lt;USE_ERRORS_FILES&gt;YES&lt;/USE_ERRORS_FILES&gt;<br /></span> Entonces si establece el valor como NO, como en la l&iacute;nea de abajo,<br /> <span class="code">&lt;USE_ERRORS_FILES&gt;NO&lt;/USE_ERRORS_FILES&gt;<br /></span>MyServer enviar&aacute;  (por defecto) un encabezado a su explorador con el c&oacute;digo de error. Pero tiene la opci&oacute;n de enviar un cuerpo HTTP incluido en el error, al agregar esta l&iacute;nea:<br> <span class="code">&lt;ERRORS_INCLUDE_BODY&gt;YES&lt;/ERRORS_INCLUDE_BODY&gt;</span> <br /> <br />Puede cambiar el dise&ntilde;o de la p&aacute;gina de exploraci&oacute;n de directorios (usada cuando no se tiene una p&aacute;gina por defecto, como se describe en la secci&oacute;n <a href="browsefolder.html">&Iacute;ndice de exploraci&oacute;n de directorios</a>. La l&iacute;nea de abajo, en myserver.xml, apunta el archivo CSS usado para configurar el dise&ntilde;o de las p&aacute;ginas de exploraci&oacute;n de directorios:<br />  <span class="code">&lt;BROWSEFOLDER_CSS&gt;system/folderstyle.css&lt;/BROWSEFOLDER_CSS&gt;</span>  


<br /> &nbsp;
<hr />
&nbsp; <br />

Las secuencias de comandos CGI pueden conseguir el correo electr&oacute;nico del Administrador del Servidor y mostrarlo al usuario (a trav&eacute;s de la variable de entorno <span class="code">SERVER_ADMIN</span>). Entonces puede ser importante que defina la direcci&oacute;n de manera adecuada, al establecer el valor en la l&iacute;nea de abajo, <span class="code">en myserver.xml</span>:<br />
      <span class="code">&lt;SERVER_ADMIN&gt;administrator@localhost&lt;/SERVER_ADMIN&gt;</span></td>
</tr>
</table>
</body>
</html>
