
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>Documentaci&oacute;n de MyServer - PHP - www.myserverproject.net</title>
<meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link rel="stylesheet" type="text/css" href="../style/myserver.css" />
</head>
<body>
<?xml version="1.0" encoding="UTF-8"?> 
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
  "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<table class="center" width="95%">
<tr>
<td class="center">
<h1 class="title">COMO USAR PHP BAJO MYSERVER</h1>
      <p><br /> <br> PHP (Preprocesador de Hipertexto) es el lenguaje de automatizaci&oacute;n del lado del servidor m&aacute;s usado en el mundo. Un lenguaje &quot;del lado del servidor&quot; se usa para crear p&aacute;ginas Web con contenido din&aacute;mico. Puede usar PHP con MyServer con el CGI ejecutable est&aacute;ndar o como servidor FastCGI. Mientras use a PHP como un CGI ejecutable. MyServer crear&aacute; procesos nuevos por cada p&aacute;gina solicitada. Mientras que use a PHP en modo FastCGI, MyServer no requiere un proceso nuevo por cada solicitud y por la tanto, el servidor funciona mejor. Por favor consulte el sitio oficial <a 
 href="http://www.fastcgi.com/" target="_blank">FastCGI</a> para m&aacute;s informaci&oacute;n sobre FastCGI.<br /> <br /> Para poder usar PHP, primero debe descargar los archivos. Aqu&iacute; hay algunos v&iacute;nculos...</p> 
		<table align=center style="border-collapse: collapse;" bordercolor="#000000" border=1 cellpadding=0 cellspacing=0>
 <tr>
  <td width=230><b>Versi&oacute;n PHP</b></td> 
  <td width=230 align=center><b>Instaladores Linux</b></td>
  <td widht=230 align=center><b>Instaladores Win32</b></td>
 </tr>

 <tr>
  <td align=center><b>PHP 4.4.0</b></td>
  <td align=center>Por favor vea a las instrucciones <br />de instalaci&oacute;n del distribuidor.</td> 
  <td align=center><a target="_blank" href="http://www.php.net/get/php-4.4.0-installer.exe/from/a/mirror">Espejos de Instaladores (1.100KB)</a><br /> <a target="_blank" href="http://www.php.net/get/php-4.4.0-Win32.zip/from/a/mirror">Espejos Zip (6.807KB)</a></td>
 </tr>

 <tr>
  <td align=center><b>PHP 5.0.5</b></td>
  <td align=center>Por favor vea a las instrucciones <br />de instalaci&oacute;n del distribuidor.</td> 
  <td align=center><a target="_blank" href="http://www.php.net/get/php-5.0.5-installer.exe/from/a/mirror">Espejos de Instaladores (2.336KB)</a><br /> <a target="_blank" href="http://www.php.net/get/php-5.0.5-Win32.zip/from/a/mirror">Espejos Zip (7.825KB)</a></td>
 </tr>

</table>
      <p>&nbsp; </p>
      <p>Usuarios Win32: Instale php en su directorio favorito: El predeterminado es C:\php</p> 

<p>Ahora que instal&oacute; el paquete PHP. Necesita configurar MyServer para poder usar php.<br /> Comenzaremos por agregar los tipos MIME de PHP. Esta gu&iacute;a agregar&aacute; los tipos MIME por GUI.<br /><br /> 1. Abra GUI de MyServer y haga clic en la pesta&ntilde;a MIME.<br /><br /> 2.  Debajo de la lista de extensiones listadas, haga clic en agregar. Escriba php, y pulse en ok.<br /> 

<img src="../images/add_mime.png" /><br /><br /> 3.    Ahora, encuentre php en la lista de extensiones y haga clic en &eacute;l. Establezca el tipo MIME en: text/html.<br /> Entonces establezca la acci&oacute;n en: Ejecute como CGI, o ejecute como FASTCGI. Esta es la preferencia principal, cualquiera de las dos funcionar&aacute;.<br /> Finalmente, necesita establecer el administrador. Para sistemas Linux, ejecute el comando &quot;which php&quot;. Ponga el resultado en el campo del administrador.<br /> Para sistemas Win32, usted debe establecer la ubicaci&oacute;n del archivo ejecutable aqu&iacute;. Si instal&oacute; php en C:\php. Pondr&iacute;a C:\php\php.exe aqu&iacute;.<br /> <img src="../images/config_mime.png" /><br /> Tambi&eacute;n puede editar  MIMEtypes.xml autom&aacute;ticamente. Puede seguir la documentaci&oacute;n <a href="mimetypes.htm">Tipos MIME</a>. Aqu&iacute; hay un ejemplo:<br /> 

 MANAGER	Administrador, Administrador, Administrador MANAGER&gt;C	Administrar..., Administrar... CMD	Comando&lt;MIMETYPE&gt;<br /> &lt;EXT&gt;php&lt;/EXT&gt;<br /> &lt;MIME&gt;text/html&lt;/MIME&gt;<br /> &lt;CMD&gt;RUNFASTCGI&lt;/CMD&gt;<br /> &lt;MANAGER&gt;C:\php\php.exe&lt;/MANAGER&gt;<br /> 

&lt;/MIMETYPE&gt;<br /> <br /> 4. &nbsp;&nbsp; Ahora que MyServer est&aacute; listo para ejecutar php, necesita modificar una l&iacute;nea en <span class="code">php.ini</span>. Necesita establecer cgi.force_redirect a nulo. Encuentre la l&iacute;nea en el archivo de configuraci&oacute;n php:<br /><br /> <span  class="code">;cgi.force_redirect= 0</span> 
<p><b>Nota:</b> <span class="code">cgi.force_redirect</span> puede ser 1. Si es as&iacute;, entonces c&aacute;mbielo a 0.<br /> 

Luego quite el primer punto y coma. Entonces se leer&aacute;:<br /> 
</p>

<span class="code">cgi.force_redirect = 0</span><br /><br />
      &iexcl;Felicitaciones! Ha finalizado de instalar php en MyServer.</td>
</tr>
</table>
</body>
</html>
