
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>Documentaci&oacute;n de MyServer - Ver su Sitio Web - www.myserverproject.net</title>
<meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link rel="stylesheet" type="text/css" href="../style/myserver.css" />
</head>
<body>
<?xml version="1.0" encoding="UTF-8"?> 
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
  "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<table class="center" width="95%">
<tr>
<td class="center">
<h1 class="title">VER SU SITIO WEB</h1>
<br /> Una vez que sus p&aacute;ginas Web est&eacute;n guardadas en el directorio correcto querr&aacute; verlas tanto en el equipo en la que las guard&oacute; como tambi&eacute;n a trav&eacute;s de Internet. <br /> <br /> Para ver sus archivos en m&aacute;quina local escriba:<br /> <br /> <span class="code">http://localhost</span><br /> <br /> en la ventana de direcciones del explorador Web.<br /> <br /> Para ver sus archivos en Internet, puede escribir la direcci&oacute;n IP de su computadora en cualquier explorador Web. Por ejemplo si su direcci&oacute;n IP es 36.65.34.32 sus archivos pueden ser encontrados en:<br /> <br /> <a href="http://36.65.34.32/"><span class="code">http://36.65.34.32</span></a><span 
 style="font-family: courier new,courier,monospace;">.</span> <br /> <br />
 
<h2 class="title">Usar un nombre DNS</h2>

Si prefiere <span class="code">http://william.homeip.net</span> en vez de su direcci&oacute;n IP debe obtener un nombre DNS.<br /> 

<br /> Un nombre DNS es un mecanismo para asignar una direcci&oacute;n IP a un nombre mnemot&eacute;cnico como <a href="http://www.google.com/" 
 target="_blank">www.google.com</a>. Puede conseguir un nombre DNS en un sistema gratuito como <a href="http://www.DynDNS.org" target="_blank">DynDNS.org</a>. Este servicio es para PCs siempre conectadas (ADSL,cable,...) que pueden ser accedidas en la mayor parte del d&iacute;a.<br /> <br> Si no tiene una direcci&oacute;n de IP est&aacute;tica, su direcci&oacute;n cambia cada vez que se conecta a internet. Pero, con un nombre DND desde DynDNS.org usted puede acceder independientemente de que su direcci&oacute;n IP es din&aacute;mica o est&aacute;tica.<br /> <br /> Para asegurarse un nombre DNS hace referencia a su equipo cada vez que se conecta a Internet, debe instalar un cliente DNS din&aacute;mico. Puede conseguir un cliente DNS gratuito en: <a 
 href="http://www.directupdate.net/" target="_blank">http://www.directupdate.net</a>.<br /> <br />
      Si no le gusta el nombre <a href="http://myname.homeip.net/"target="_blank">http://myName.homeip.net</a> 
      pero le gustar&iacute;a un nombre como <a href="http://www.myname.net/"target="_blank">http://www.myName.net</a> 
      necesita registrar un dominio a trav&eacute;s de un registro.</td>
</tr>
</table>
</body>
</html>
