
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>Documentaci&oacute;n de MyServer - Crear Hosts Virtuales - www.myserverproject.net</title>
<meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link rel="stylesheet" type="text/css" href="../style/myserver.css" />
</head>
<body>
<?xml version="1.0" encoding="UTF-8"?> 
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
  "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<table class="center" width="95%">
<tr>
<td class="center">
<h1 class="title">HOSTS VIRTUALES</h1>
<br /> En teor&iacute;a, los hosts virtuales permiten a los usuarios alojar un n&uacute;mero infinito de sitios en una sola m&aacute;quina. Por ejemplo http://mypc.net es diferente a http://sub.mypc.net. Para definir hosts virtuales en MyServer abra el archivo virtualhosts.xml en un editor de texto (como en bloc de notas Windows o GNU Emacs en GNU/Linux). Un archivo de ejemplo de host virtuales se ve as&iacute;:<br /> <br />
       <span class="code">&lt;VHOSTS&gt;<br />
        -<br />
        &nbsp;&nbsp;&nbsp; &lt;VHOST&gt;<br />
        &lt;NAME&gt;Todas as conex&otilde;es&lt;/NAME&gt;<br />
        &lt;PORT&gt;80&lt;/PORT&gt;<br />
        &lt;PROTOCOL&gt;HTTP&lt;/PROTOCOL&gt;<br />
        &lt;DOCROOT&gt;web&lt;/DOCROOT&gt;<br />
        &lt;SYSFOLDER&gt;system&lt;/SYSFOLDER&gt;<br />
        &lt;ACCESSESLOG&gt;logs/myServer.log&lt;/ACCESSESLOG&gt;<br />
        &lt;WARNINGLOG&gt;logs/myServer.err&lt;/WARNINGLOG&gt;<br />
        &lt;/VHOST&gt;<br />
        &lt;/VHOSTS&gt;</span><br />
      <br><br>
      <br /><br /><br /> <span class="code">&lt;NAME&gt;</span> le da al administrador del servidor una idea de que el host virtual como una Ethernet interna, Ethernet externa o cualquier conexi&oacute;n.&nbsp; <br /> <br /> <span class="code">&lt;PORT&gt;</span> es el puerto usado para aceptar conexiones<br /> <span class="code">&lt;IP&gt;</span> que es opcional. Es la direcci&oacute;n IP para la interfaz de su host virtual en la que trabaja. La opci&oacute;n <span class="code">useRegex=&quot;YES&quot;</span> significa que la direcci&oacute;n actuar&aacute; como una direcci&oacute;n regular, no s&oacute;lo como un valor fijo. Esto es m&aacute;s &uacute;til para redes con direccionamiento IP din&aacute;mico.<br /> <span class="code">&lt;PROTOCOL&gt;</span> es el protocolo a ser usado por el host <br /> <span class="code"></span><span class="code">&lt;DOCROOT&gt;</span> es la carpeta en donde se encuentran los archivos <br /> <span class="code">&lt;SYSFOLDER&gt;</span> es la carpeta de sistema<br /> <span class="code">&lt;HOST&gt;</span> es su nombre de host virtual. La opci&oacute;n <span class="code">useRegex=&quot;YES&quot;</span> significa que la direcci&oacute;n actuar&aacute; como una direcci&oacute;n regular, no s&oacute;lo como un valor fijo.<br /> <span class="code">&lt;ACCESSLOG&gt;</span> es el registro de acceso a los host virtuales<br /> <span class="code">&lt;WARNINGLOG&gt;</span> es el archivo de registro de errores por el host virtual.<br /> <span class="code">&lt;ALLOW_CGI&gt;</span> Esta opci&oacute;n deniega el acceso al CGI en el host virtual. Esta l&iacute;nea puede existir en myserver.xml tambi&eacute;n, como una configuraci&oacute;n global, pero se incluye en virtualhosts.xml, esta ser&aacute; la que ser&aacute; considerada.<span class="code"> ALLOW_CGI</span> puede aparecer como <span class="code">ALLOW_FASTCGI</span>, <span class="code">ALLOW_ISAPI</span>, <span class="code">ALLOW_MSCGI</span> , <span class="code">ALLOW_WINCGI</span>, <span class="code">ALLOW_SEND_LINK, ALLOW_EXTERNAL_COMMANDS</span>, <span class="code">ALLOW_SEND_FILE</span>, cada uno de ellos denegando/permitiendo el controlador de informaci&oacute;n HTTP apropiado.<br /> <br /><br /> Los archivos de errores pueden tener otras opciones:<br /> <span class="code">&lt;ACCESSESLOG type=&quot;combined&quot;&gt;logs/myServerHTTP.log&lt;/ACCESSESLOG&gt;</span> <br /> Con esta opci&oacute;n, los registros tendr&aacute;n dos campos extras: Remitente HTTP y Agente Usuario HTTP.<br /> Al usar <span class="code">cycle=&quot;yes&quot;</span> habilitar&aacute; el ciclado de registro en el archivo de registros. Cuando un archivo de registro que habilita el &quot;ciclado&quot; alcanza el tama&ntilde;o mayor para archivos de registros, grabar&aacute; su contenido a un archivo nuevo y recrear&aacute; el archivo original. Se usa compresi&oacute;n gzip de los archivos de registro ciclados de manera predeterminada para ahorrar espacio, si no quiere usar gzip especifique <span class="code">cycle_gzip=&quot;no&quot;</span>. <br /> 
      <hr />
        <span class="center">MyServer le da la opci&oacute;n de habilitar el comando HTTP TRACE para cada host virtual. S&oacute;lo necesita editar el archivo security.xml de la ra&iacute;z de su host virtual (no un subdirectorio, si no existe el archivo, puede crear uno con el formato descripto en la secci&oacute;n <a href="Security.html">Seguridad</a> de esta documentaci&oacute;n), y agregue el par&aacute;metro:<br><br> </span>
        <span class="code">&lt;HTTP TRACE=&quot;ON&quot; /&gt;<br><br></span>
        <span class="center">Una vez que lo hace, habilita el comando HTTP TRACE. Esta predeterminado como deshabilitado (as&iacute; que s&oacute;lo elimine la &iacute;nea para deshabilitarlo)<br> </span>
        
    </td>
</tr>
</table>
</body>
</html>
