
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>Documentaci&oacute;n de MyServer - Servidor Web - www.myserverproject.net</title>
<meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link rel="stylesheet" type="text/css" href="../style/myserver.css" />
</head>
<body>
<?xml version="1.0" encoding="UTF-8"?> 
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
  "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<table class="center" width="95%">
<tr>
<td class="center">
<h1 class="title">SERVIDOR WEB</h1>
<h2 class="title">&iquest;Qu&eacute; es un servidor Web?</h2> 
Un servidor Web es una aplicaci&oacute;n, que les permite a los usuarios compartir documentos a trav&eacute;s de Internet o una red local.<br /><br /> Para conectarse con el servidor Web necesita un explorador Web.<br /><br /> <img src="../images/webserver.png" title="" alt="Muchos clientes se conectan al Servidor Web" class="box" width="394" height="513" /> <br /> Muchos clientes se conectan a un servidor Web. <br /> <br /> La imagen muestra cu&aacute;ntos clientes pueden estar conectados con un servidor al mismo tiempo. La solicitud llega el servidor a trav&eacute;s de la red. El servidor prepara una respuesta y se env&iacute;a al cliente. La evoluci&oacute;n de Internet hizo que el modelo Servidor-Cliente fuera el modo m&aacute;s f&aacute;cil de compartir informaci&oacute;n, d&aacute;ndole la posibilidad a cada usuario de decidir que es lo que quiere compartir con otros usuarios. <br /> 
<h2 class="title">&iquest;C&oacute;mo se comparten los archivos?</h2> 
Usando el nivel b&aacute;sico, el servidor Web comparte documentos HTML e im&aacute;genes. Estos documentos e im&aacute;genes son muy simples, est&aacute;ticos y b&aacute;sicos, que ve cuando accede a un sitio Web. Estos archivos se transfieren por HTTP (HyperText Transfer Protocol).  <br /> <br /> Si se necesita un contenido din&aacute;mico, por ejemplo ejecutar un sitio Web de comercio electr&oacute;nico, para la comunicaci&oacute;n del servidor Web se usa protocolos diferentes con un proceso externo. Algunos de estos protocolos son: Common Gateway Interface (CGI), ISAPI, FastCGI y WinCGI.<br /> HTTP no es un protocolo seguro porque la transmisi&oacute;n no est&aacute; cifrada. Las posibilidades de cifrado para transmisiones seguras est&aacute;n dadas por HTTPS (HyperText Transfer Procol Secure). M&aacute;s acerca de HTTPS <a href="HTTPS.html">aqu&iacute;</a>. <br /> 
<h2 class="title">Traducci&oacute;n de Ruta de acceso</h2> 
Los servidores traducen el componente de ruta de un URI el recurso del sistema de archivos locales. La ruta URI especificada por el cliente es relativa al directorio ra&iacute;z del servidor Web (<a href="virtualhosts.html">Hosts Virtuales</a>). Por ejemplo el cliente puede solicitar un archivo <span class="code">/mydirectory/myfile</span> a trav&eacute;s de una solicitud como: <br /> <br />  HTTP	&quot;&quot;&quot;HTTP&quot;&quot;&quot; GET	Obtener<span class="code">GET /mydirectory/myfile HTTP/1.1<br /> Host: www.host.com</span> <br /> <br />
      El servidor asigna el nombre de archivo al directorio ra&iacute;z del host 
      virtual actual. Si el directorio ra&iacute;z es <span class="code">/var/www</span> 
      el recurso devuelto ser&aacute; <span class="code">/var/www/mydirectory/myfile</span> 
      de acuerdo a la especificaci&oacute;n para su tipo MIME.</td>
</tr>
</table>
</body>
</html>