<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr">
<head>
	<title>Documentation MyServer - MIME - www.myserverproject.net</title>
	<meta http-equiv="content-type" content="text/html;charset=UTF-8" />
	<meta http-equiv="Content-Style-Type" content="text/css" />
	<link rel="stylesheet" type="text/css" href="../style/myserver.css" />
</head>
<body>
	<table class="center" width="95%">
		<tr>
			<td class="center">
				<h1 class="title">TYPES MIME</h1>
				<br /><p>
				<br />Vous pouvez modifier les types MIME utilis&eacute;s par MyServer en modifiant le fichier
				"MIMEtypes.xml". Voici un exemple de fichier .xml:
				<br /><span class="code">&lt;MIMETYPES&gt;
				<br />-
				<br />&lt;MIMETYPE&gt;
				<br />-
				<br />&lt;MIMETYPE defaultAction=&quot;DENY&quot;&gt;
				<br />&lt;EXT&gt;htm&lt;/EXT&gt;
				<br />&lt;MIME&gt;text/html&lt;/MIME&gt;
				<br />&lt;CMD&gt;SEND&lt;/CMD&gt;
				<br />&lt;ACTION name=&quot;Host&quot; value=&quot;localhost&quot;&gt;ALLOW&lt;/ACTION&gt; 
				<br />&lt;FILTER&gt;gzip&lt;/FILTER&gt;
				<br />&lt;MANAGER&gt;NONE&lt;/MANAGER&gt;
				<br />&lt;/MIMETYPE&gt;
				<br /></span>
				<br />
				<br />
				Chaque bloc d&eacute;crit un type MIME diff&eacute;rent.
				<br />
				<br />
				<span class="code">&lt;EXT&gt;</span> est l'extension du fichier.<br />
				<br />
				<span class="code">&lt;MIME&gt;</span> est le type MIME.
				<br />
				<br /><span class="code">&lt;CMD&gt;</span> est le type d'envoi au client.
				<br />
				<br /><span class="code">&lt;ACTION name=&quot;Host&quot; value=&quot;localhost&quot;&gt;ALLOW&lt;/ACTION&gt;</span>
				permettra l'accès au type MIME d&eacute;sir&eacute; si l'hôte est &quot;localhost&quot;. 
				La ligne <span class="code">&lt;MIMETYPE defaultAction=&quot;DENY&quot;&gt;</span> indique que
				notre type MIME refusera l'accès à tout hôte virtuel ne poss&eacute;dant pas de ligne ACTION (i.e. il
				devra exister dans la configuration). De plus, la propriet&eacute;
				<br /><span class="code">defaultAction </span>
				<br />est optionnelle (il vaut &quot;ALLOW&quot; s'il est omis).
				Ainsi, dans l'exemple ci dessus, les fichiers HTML ne seront accessibles que sur l'hôte &quot;localhost&quot;.</p>
				
				<p>La balise &lt;ACTION&gt; est optionnelle, à moins d'indiquer &quot;DENY&quot; 
				comme defaultAction de votre type MIME.
				<br />
				<br />
				<span class="code">&lt;FILTER&gt;</span>
				d&eacute;finit un filtre pour ce type MIME. Les donn&eacute;es
				seront filtr&eacute;es avant d'être envoy&eacute;es à l'utilisateur. Dans l'exemple ci dessus, les donn&eacute;es seront
				envoy&eacute;es à l'utilisateur compress&eacute;es au format gzip. Cela veut dire que gzip fonctionne comme un filtre
				dans MyServer. Vous pouvez d&eacute;finir gzip pour être lanc&eacute; à chaque fois qu'une certaine taille de
				donn&eacute;es doit être envoy&eacute;e, en sp&eacute;cifiant l'option &lt;GZIP_THRESHOLD&gt; dans votre fichier
				myserver.xml. Pour des raisons &eacute;videntes, les donn&eacute;es seront envoy&eacute;es en gzip seulement si le
				client peut recevoir de tels fichiers - sans quoi il recevrait d'&eacute;tranges caractères à la place
				du fichier d&eacute;sir&eacute;.
				<br />
				<br />En règle g&eacute;n&eacute;ral, les filtres peuvent &eacute;galement être appliqu&eacute;s à des donn&eacute;es dynamiques - comme
				CGI, ISAPI, FastCGI - mais ils ne peuvent pas modifier le contenu des pages envoy&eacute;es à l'utilisateur.
				<br />
				<br /><span class="code">&lt;MANAGER&gt;</span> d&eacute;crit la commande <span class="code">&lt;CMD&gt;</span>
				<br />
				<br />
				<br />
				<br />Les valeurs suivantes d'envoi de fichier au client sont valables dans la section 
				<span class="code">&lt;MANAGER&gt;</span>:
				<br /></p><div class="left">
				<ol>
					<li><span class="code">SEND</span>
					- Envoi le fichier en texte brut. Cette commande est utilis&eacute;e pour des extensions comme
					.html ou .jpg, qui n'ont pas besoin d'intervention externe au navigateur.</li>
					<li><span class="code">RUNCGI</span>
					- Ex&eacute;cute le script CGI sp&eacute;cifi&eacute; par le chemin. Il est utilis&eacute; pour des extensions comme
					.php ou .pl qui n&eacute;cessite d'être trait&eacute;s avant d'être envoy&eacute; au client.</li>
					<li><span class="code">RUNFASTCGI</span><span style="color: rgb(0, 102, 0);"> </span>
					- Ex&eacute;cute le script FastCGI. Ce type n&eacute;cessite le t&eacute;l&eacute;chargement d'un parseur fastcgi
					(voir la page PHP). Il est &eacute;galement utilis&eacute; pour des extensions comme .php et .pl</li>
					<li><span class="code">EXECUTEFASTCGI</span>
					- Ex&eacute;cute &eacute;galement le script FastCGI, mais contrairement à RUNFASTCGI ci dessus, il n'a
					pas besoin d'un serveur pour ex&eacute;cuter le script, mais fonctionne comme un propre serveur.</li>
					<li><span class="code">RUNMSCGI</span>
					- Ex&eacute;cute un script MSCGI. Cette bibliothèque n'est utilis&eacute;e que par myServer. Elle permet
					la cr&eacute;ation de CGIs rapides et efficaces.</li>
					<li><span class="code">EXECUTE </span>
					- Traite le fichier comme un executable et retourne le r&eacute;sultat au client.&nbsp;</li>
					<li><span class="code">SENDLINK</span>
					- Retourne le fichier vers lequel pointe le lien.</li>
					<li><span class="code">EXECUTEWINCGI</span>
					- Envoie le fichier comme WinCGI</li>
					<li><span class="code">RUNISAPI</span>
					- Ex&eacute;cute un script ISAPI.
					&nbsp;</li>
					<li><span class="code">EXECUTEISAPI</span>
					- Ex&eacute;cute &eacute;galement un script ISAPI mais sans besoin d'un serveur. Agit comme son
					propre serveur à la place.</li>
				</ol>
				</div>
				La plupart des applications sont d&eacute;jà support&eacute;s dans le fichier .xml. Si vous voulez ajouter
				un type MIME, rajoutez le dans le fichier en utilisant l'exemple.
			</td>
		</tr>
	</table>
</body>
</html>