<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="content-type"
 content="text/html; charset=ISO-8859-1">
  <link rel="stylesheet" type="text/css" href="myserver.css">
  <title>Web Server</title>
</head>
<body>
<h1 class="title">HTTPS</h1>
1) Notas breves sobre encripta&ccedil;&atilde;o de dados<br> 2) Como criar certificados 
SSL com o OpenSSL <br> 3) Use certificados no MyServer <br> 
<h2>Notas breves sobre encripta&ccedil;&atilde;o de dados</h2>
<p> A encripta&ccedil;&atilde;o de dados &eacute; usada para proteger os dados 
  que s&atilde;o enviados entre o cliente e o servidor. H&aacute; dois tipos de 
  algoritmo: algoritmos de encripta&ccedil;&atilde;o de dados sim&eacute;tricos 
  e assim&eacute;tricos. A diferen&ccedil;a entre os dois tipos de algoritmo &eacute; 
  que para os algoritmos sim&eacute;tricos, a mesma chave &eacute; usada para 
  encriptar e para decriptar. Esses algoritmos n&atilde;o s&atilde;o usados em 
  servidores com grande n&uacute;mero de clientes em potencial, porque os dados 
  capturados podem ser decriptados por qualquer cliente que souber a chave e porque 
  a chave precisa ser distribu&iacute;da de modo seguro (por exemplo, usando um 
  disquete) e n&atilde;o distribuir numa rede grande como a Internet. Os algoritmos 
  assim&eacute;tricos trabalham de forma diferente, os dados encriptados com uma 
  chave podem ser decriptados somente com a outra chave e vice-versa. Qualquer 
  um conhece a chave p&uacute;blica, mas s&oacute; o dono conhece a chave privada. 
  Desse modo o dono da chave n&atilde;o tem que distribuir a chave s&oacute; para 
  os clientes conhecidos, mas pode distribu&iacute;-la em uma rede de larga escala.
<h2>Como criar certificados SSL com o OpenSSL </h2>
<p> Um certificado &eacute; necess&aacute;rio para certificar sua identidade junto 
  a um CA(Certification Authority - Autoridade de Certifica&ccedil;&atilde;o). 
  Voc&ecirc; pode usar um certificado sem registrar em um CA, criando um certificado 
  Root Certification. Voc&ecirc; pode encontrar tudo o que precisa para criar 
  certificados na biblioteca OpenSSL, em www.openssl.org. Ap&oacute;s a instala&ccedil;&atilde;o, 
  v&aacute; ao diret&oacute;rio do programa e digite: 
<p  class="code">
openssl genrsa -out server.key 
</p>
Isso vai criar uma chave privada para codificar seus dados. Depois, rode esse 
comando: 
<p  class="code">
openssl req -new -x509 -days 730 -config openssl.cnf -key server.key -out server.pem 
</p>
Para criar o certificado p&uacute;blico. Desse modo, o certificado pode ser usado 
por 730 dias e a chave p&uacute;blica ser&aacute; o arquivo server.pem. 
<h2>Use certificados no MyServer </h2>
<p> Para configurar os certificados no MyServer voc&ecirc; tem que colocar os 
  dois arquivos: server.key, server.pem na pasta certificates no caminho da instala&ccedil;&atilde;o 
  do MyServer. Depois disso voc&ecirc; tem que configurar um host virtual https 
  no arquivo virtualhosts.xml. 
<p  class="code"> &lt;VHOST&gt;  &lt;NAME&gt;Todas as conex&otilde;es&lt;/NAME&gt; 
  &lt;PORT&gt;443&lt;/PORT&gt;  &lt;SSL_PRIVATEKEY&gt;certificates/server.key&lt;/SSL_PRIVATEKEY&gt;  
  &lt;SSL_CERTIFICATE&gt;certificates/server.pem&lt;/SSL_CERTIFICATE&gt;  
  &lt;PROTOCOL&gt;HTTPS&lt;/PROTOCOL&gt;  &lt;DOCROOT&gt;web&lt;/DOCROOT&gt;  
  &lt;SYSFOLDER&gt;system&lt;/SYSFOLDER&gt;  &lt;ACCESSESLOG&gt;logs/myServer.log&lt;/ACCESSESLOG&gt;  
  &lt;WARNINGLOG&gt;logs/myServer.err&lt;/WARNINGLOG&gt;  &lt;/VHOST&gt;  
</p>
Com esse host n&oacute;s colocamos um listener de https na porta 443 (o padr&atilde;o 
para o https) e usamos o arquivo certificates/server.key para a chave privada 
e o certificates/server.pem para a p&uacute;blica. 
</body>
</html>