<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
  "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>MyServer Belgeleri - FastCGI - www.myserverproject.net</title>
<meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link rel="stylesheet" type="text/css" href="../style/myserver.css" />
</head>
<body>
<table class="center" width="95%">
<tr>
<td class="center">
<h1 class="title">FASTCGI<br />
</h1>
FastCGI CGI &uuml;zerine bir eklentidir, kullanılan dile bağlı değildir, uygulamalar i&ccedil;in sunucuya &ouml;zel API ler kullanmayarak y&uuml;ksek performans sağlar. FastCGI'da, her bir komut istemi i&ccedil;in ayrı bir işlem yapılmaz. MyServer işlemi ile iletişimi soketler &uuml;zerinden ger&ccedil;ekleştirilir. <br /> <br /> FastCGI'ı MyServer i&ccedil;inde kullanabilirsiniz, bunun i&ccedil;in yalnızca sizin komut dilinizin <a
 href="mimetypes.html" class="code">MIME Tipini</a> FastCGI olarak &ccedil;alıştırılmasını ayarlamalısınız (<span class="code">RUNFASTCGI</span><span
 style="color: rgb(0, 102, 0);"></span> olarak ayarlayın).<br /> <br /> PHP ve FastCGI'ı birlikte kullanmak i&ccedil;in <a class="code" href="php.html">PHP</a> b&ouml;l&uuml;m&uuml;n&uuml; okuyun.<br /> <br /> CGI'da olduğu gibi, MyServer altında aşağıda g&ouml;r&uuml;nd&uuml;ğ&uuml; gibi <span class="code">web</span> dizini i&ccedil;inde <span class="code">cgi-bin</span> dizini yaratabilir, ve t&uuml;m uygulamalarınızı i&ccedil;ine koyabilirsiniz:<br /> <br /> <br />
      <div style="text-align: center;"><img src="../images/myfiles.png" title=""
 alt="Web dizini" height="260" width="468" style="border: 1px solid #000000" /> <br />
</div>
<div style="text-align: center;"><small>cgi-bin dizini, doğrudan se&ccedil;ili web dizini altındadır.</small><br />
</div>
<br /> <br /> <br /> Buna rağmen, CGI komut dosyaları uzantıları aracılığı ile web sunucuya adreslendikleri takdirde her hangi bir yerde saklanabilirler. <br /> <br /> <br />

<h2 class="title">Uzak FastCGI Sunucuları</h2>
MyServer uzaktan FastCGI sunucusu kullanabilme yeteneğine sahiptir. Aşağıdaki MIME tipleri uzak bağlantı kullanır:<br />

<span class="code">&lt;MIMETYPE&gt;<br /> &lt;EXT&gt;php&lt;/EXT&gt;<br /> &lt;MIME&gt;text/html&lt;/MIME&gt;<br /> &lt;CMD&gt;RUNFASTCGI&lt;/CMD&gt;<br /> <br /> &lt;MANAGER&gt;@host:port&lt;/MANAGER&gt;<br /> &lt;/MIMETYPE&gt;<br /></span> <br /> Uzaktan y&ouml;netim i&ccedil;in tanımlamanın @ ile başlaması gerekir. <br />

MIME tiplerini Kontrol merkezi uygulaması &uuml;zerinden ayarlıyorsanız, FastCGI adres alanında aşağıdaki şekildeki satırı ekleyerek uzak sunucu ekleyebilirsiniz <br /> <span class="code">@HOST:PORT </span><br />


<br /> <br /> FastCGI ile ilgili ayrıntılı bilgi i&ccedil;in resmi <a href="http://www.fastcgi.com/"
 target="_blank">FastCGI </a> sitesine bakınız.<br /> <br />
</td>
</tr>
</table>
</body>
</html>
