<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
  "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>MyServer Belgeleri - Sanal Ana Makinalar Yaratmak - www.myserverproject.net</title>
<meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link rel="stylesheet" type="text/css" href="../style/myserver.css" />
</head>
<body>
<table class="center" width="95%">
<tr>
<td class="center">
<h1 class="title">SANAL ANA MAKİNALAR</h1>
<br /> Teoride, sanal ana makinalar, tek bir makina altında, kullanıcılara sınırsız web sitesi yayınlama imkanı sunar. &Ouml;rnek olarak http://mypc.net adresi http://sub.mypc.net adresinden farklıdır. MyServer'da sanal ana makina tanımlamak i&ccedil;in, virtualhosts.xml dosyasını bir metin d&uuml;zenleyici (Windows'ta notepad veya GNU/Linux'te GNU Emacs gibi) a&ccedil;ın. &Ouml;rnek sanal ana makina ayar dosyası ş&ouml;yle g&ouml;r&uuml;n&uuml;r:<br /> <br />
      <p class="code">&lt;VHOSTS&gt;<br /> -<br /> &nbsp;&nbsp;&nbsp; &lt;VHOST&gt;<br /> &lt;NAME&gt;Every connection&lt;/NAME&gt;<br /> &lt;PORT&gt;80&lt;/PORT&gt;<br /> &lt;IP&gt;127.0.0.1&lt;/IP&gt; <br /> &lt;PROTOCOL&gt;HTTP&lt;/PROTOCOL&gt;<br /> &lt;DOCROOT&gt;web&lt;/DOCROOT&gt;<br /> &lt;SYSFOLDER&gt;system&lt;/SYSFOLDER&gt;<br /> &lt;HOST&gt;www.mysite.com&lt;/HOST&gt; <br /> &lt;ACCESSESLOG&gt;logs/myServer.log&lt;/ACCESSESLOG&gt;<br /> &lt;WARNINGLOG&gt;logs/myServer.err&lt;/WARNINGLOG&gt;<br /> &lt;ALLOW_CGI&gt;NO&lt;/ALLOW_CGI&gt;<br /> &lt;/VHOST&gt;<br /> -<br /> &lt;/VHOSTS&gt;<br />
      </p>
      <br /><br /><br /> <span class="code">&lt;NAME&gt;</span> sunucu y&ouml;neticisine sanal ana makinanın ne olduğu hakkında bir fikir verir &ouml;rneğin dahili Ethernet, harici ethernet veya her bağlantı.&nbsp; <br /> <br /> <span class="code">&lt;PORT&gt;</span> bağlantıları kabul ettiği kapıdır <br /> <span class="code">&lt;IP&gt;</span> tercihe bağlıdır. Bu sanal ana makinalarının &uuml;zerinde &ccedil;alışacağı IP adresidir. <span class="code">useRegex=&quot;YES&quot;</span> se&ccedil;eneği adresin sabit bir değer değil de genel bir deyim gibi  davranacağı anlamına gelir. Bu dinamik IP adresli ağlarda daha kullanışlıdır.<br /> <span class="code">&lt;PROTOCOL&gt;</span> ana makinalar tarafından kullanılacak protokollerdir<br /> <span class="code"></span><span class="code">&lt;DOCROOT&gt;</span> dosyaların bulunduğu dizin adıdır<br /> <span class="code">&lt;SYSFOLDER&gt;</span> sistem dizinidir<br /> <span class="code">&lt;HOST&gt;</span> sanal ana makinanızın adıdır. The optional <span class="code">useRegex=&quot;YES&quot;</span> se&ccedil;eneği adresin sabit bir değer değil de genel bir deyim gibi  davranacağı anlamına gelir.<br /> <span class="code">&lt;ACCESSLOG&gt;</span> sanal ana makina tarafından kullanılan erişim ge&ccedil;mişidir <br /> <span class="code">&lt;WARNINGLOG&gt;</span> sanal ana makina tarafından kullanılan hata ge&ccedil;mişidir.<br /> <span class="code">&lt;ALLOW_CGI&gt;</span> Bu se&ccedil;enek bu sanal ana makinada CGI'a erişimi yasaklayacaktır. Bu satır ayrıca global ayar olarak myserver.xml dosyasında da yer alabilir fakat eğer virtualhosts.xml dosyasında mevcutsa, bu dikkate alınır.<span class="code"> ALLOW_CGI</span> ayrıca şu şekillerde de g&ouml;r&uuml;lebilir <span class="code">ALLOW_FASTCGI</span> , <span class="code">ALLOW_ISAPI</span>, <span class="code">ALLOW_MSCGI</span> , <span class="code">ALLOW_WINCGI</span>, <span class="code">ALLOW_SEND_LINK, ALLOW_EXTERNAL_COMMANDS</span>, <span class="code">ALLOW_SEND_FILE</span>, her biri kullanılacak ilgili HTTP veri işleyicisine izin verip yasaklar.<br /> <br /><br /> Ge&ccedil;miş kayıt dosyalarınnı ayrıca diğer se&ccedil;enekleri olabilir:<br /> <span class="code">&lt;ACCESSESLOG type=&quot;combined&quot;&gt;logs/myServerHTTP.log&lt;/ACCESSESLOG&gt;</span> <br /> Bu se&ccedil;enekle, kayıtlarda iki ek alan bulunacaktır: HTTP Aktarıcı ve HTTP Kullanıcı Ajanı.<br /> <span class="code">cycle=&quot;yes&quot;</span> kullanılarak kayıt dosyasında ge&ccedil;miş kayıt &ccedil;eviriciyi etkinleştirebilirsiniz. &Ccedil;evirici etkinleştirilmiş bir kayıt dosyası en b&uuml;y&uuml;k kayıt dosyası boyutuna eriştiği zaman, yeni bir dosya yaratıp yeni i&ccedil;eriği o dosyaya yazacaktır. &Ouml;n tanımlı olrak, &ccedil;evrimli kayıt dosyaları alan kazanmak i&ccedil;in gzip sıkıştırma kullanırlar, eğer gzip sıkıştırmasını istemiyorsanız, ş&ouml;yle belirtmelisiniz<span class="code">cycle_gzip=&quot;no&quot;</span>. <br />
      <hr />
        <p class="center">MyServer her bir sanal ana makina i&ccedil;in HTTP TRACE komutunu etkinleştirme se&ccedil;eneğini sunmaktadır. Tek yapmanız gereken, sanal ana makinanızın k&ouml;k dizinindeki (bir alt dizin değildir! eğer dosya mevcut değilse, bu kılavuzun <a href="Security.html">G&uuml;venlik</a> b&ouml;l&uuml;m&uuml;nde tanımlandığı gibi yeni bir dosya yaratabilirsiniz) security.xml dosyasını d&uuml;zenleyin ve şu parametreyi ekleyin</p>
        <p class="code">&lt;HTTP TRACE=&quot;ON&quot; /&gt;</p>
        <p class="center">Bunu bir kez yaptığınızda HTTP TRACE komutunu etkinleştirmiş olursunuz. &Ouml;n tanımlı olarak, etkin değildir (yani, iptal etmek isterseniz, basit&ccedil;e satırı silin)</p>
        <br /><br />

<hr />
MyServer Unix-t&uuml;revi İşletim Sistemlerinde (&ouml;rn.:Linux, *BSD, GNU/HURD, Solaris, vb.) symlinks'i takip etme &ouml;zelliğini de sunar. <br /> Symlink takip etme &ouml;zelliğini, her bir sanal ana makina i&ccedil;in virtualhosts.xml dosyasında ekleyebilirsiniz.<br /> <span class="code">&lt;FOLLOW_LINKS&gt;YES&lt;/FOLLOW_LINKS&gt;</span><br /><br /> Varsayılanı : <span class="code">&lt;FOLLOW_LINKS&gt;NO&lt;/FOLLOW_LINKS&gt;</span> MyServer tarafından varsayılan olarak bu değer kullanılır.
</td>
</tr>
</table>
</body>
</html>