<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
  "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>MyServer Belgeleri - Web Sunucu - www.myserverproject.net</title>
<meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link rel="stylesheet" type="text/css" href="../style/myserver.css" />
</head>
<body>
<table class="center" width="95%">
<tr>
<td class="center">
<h1 class="title">WEB SUNUCU</h1>
<h2 class="title">Web Sunucu Nedir?</h2>
Web sunucu, kullanıcıların internet veya yerel ağ &uuml;zerinde belge paylaşmalarına izin veren bir uygulamadır.<br /><br /> Web sunucuya bağlanmak i&ccedil;in yalnızca bir web tarayıcıya ihtiyacınız vardır.<br /><br /> <img src="../images/webserver.png" title="" alt="Web Sunucuya bağlanan bir &ccedil;ok istemci" class="box" width="394" height="513" /> <br /> Bir web sunucuya bağlanan bir &ccedil;ok istemci. <br /> <br /> Bu resim, aynı anda sunucunuza &ccedil;eşitli istemcilerin nasıl bağlandığını g&ouml;stermektedir. Sunucunuza talepler ağ &uuml;zerinden gelir. Sunucu tarafınfan bir cevap hazırlanır ve istemciye geri g&ouml;nderilir. Internetin evrimi, Sunucu-İstemci modelini bilgi paylaşmak i&ccedil;in, her kullanıcıya diğer kullanıcılarla ne paylaşmak istediğine kolayca karar verebilme şansı verecek hale getirmiştir. <br />
<h2 class="title">Dosyalar nasıl paylaşılır?</h2>
Temel seviyede, web sunucu HTML dosyaları ve resimleri paylaşır. Bu belgeler bir websitesine bağlandığınızda g&ouml;rd&uuml;ğ&uuml;n&uuml;z &ccedil;ok basit, statik ve temel dosyalardır. Bu dosyalar HTTP (Hiper Metin Aktarım Protokolu) aracılığı ile aktarılır. <br /> <br /> Eğer dinamik i&ccedil;eriğe ihtiya&ccedil; duyulursa, &ouml;rneğin bir e-ticaret sitesi &ccedil;alıştırmak i&ccedil;in, web sunucunun harici bir işlem ile iletişimi i&ccedil;in farklı protokoller kullanılır. Bu protokollerin bazıları Ortak Ağ Ge&ccedil;idi Aray&uuml;z&uuml; (CGI), ISAPI, FastCGI ve WinCGI'dır.<br /> HTTP g&uuml;venli bir protokol değildir, &ccedil;&uuml;nk&uuml; veri aktarımı şifrelemeden yapılır. G&uuml;venli aktarım i&ccedil;in şifreleme imkanları HTTPS (G&uuml;venli Hiper Metin Aktarı Protokolu ) ile verilir. Ayrıntılı HTTPS bilgisi <a href="HTTPS.html">i&ccedil;in</a>. <br />
<h2 class="title">Adres &ccedil;evirimi</h2>
Web sunucular, URI'deki adres bileşenini kaynak yerel dosya sistemindeki adrese &ccedil;evirir. İstemci tarafından belirlenen URI adresi web sitesinin k&ouml;k dizinine g&ouml;redir (<a href="virtualhosts.html">Sanal Ana Makinalar</a>). &Ouml;rneğin istemci <span class="code">/mydirectory/myfile</span> dosyasını şu şekilde talep edebilir: <br /> <br /> <span class="code">GET /mydirectory/myfile HTTP/1.1<br /> Host: www.host.com</span> <br /> <br /> Sunucu dosya adını o anki sanal ana makinanın k&ouml;k dizininde adresler. Eğer k&ouml;k dizini  <span class="code">/var/www</span> ise &ccedil;evirim sonucu kaynak, o MIME tipinin &ouml;zelliklerine bağlı olarak <span class="code">/var/www/mydirectory/myfile</span> şeklindedir.
</td>
</tr>
</table>
</body>
</html>